export const work = [
	{
		title: '建設会社のホームページ',
		desc: 'サイトにはBasic認証をかけています。ID: webson PASS: webson-pass。配布されていたコーディング教材をコーディングしました。Photoshopのデザインカンプ。Zeplinを中心にしながらコーディングを勧めました。わからないところのググりも含めて３５時間くらいかかりました。FLOCSSで丁寧なCSSをかけたと思います。 ',
		imageUrl: 'const-company_mockuper',
	},
	{
		title: 'ブルーリーフパートナーズ様LP',
		desc: 'ブルーリーフパートナーズ様のウェブ制作事業のためのランディングページ。XDデザインカンプをコーディングしました。デザイナー、ディレクターとコミュニケーションをとりながら、コーディングしました。デザインで特に指定はなかったサービス部分のJavaScriptアニメーションについて、ユーザーの操作を想像しながら、画面をFixさせるなどの機能、背景クリックでもクローズするなどの機能を提案して採用していただきました。',
		imageUrl: 'blue-leaf_mockup',
	},
	{
		title: '英会話＋フィットネス',
		desc: 'Basic認証をかけています。ID:webson PASS:webson-pass。練習用デザインカンプをコーディングしました。モバイルファースト。メインビジュアルのアニメーションはCSSで記述。コンテンツが現れてくるアニメーションをAOSを利用しました。StudioブロックのスライドはSwiper.jsを使って実装しています。',
		imageUrl: 'eng_mockup',
	},
	{
		title: '英会話スクール（WordPress）',
		desc: 'Basic認証。ID : webson パスワード : webson-pass。XDデザインよりコーディングを行っております。クライアント様が更新できるようにトップページの事例、コース・料金ページの価格部分にカスタムフィールドを使用。公式のテーマユニットテストデータを使用して、投稿のレイアウト崩れをチェック。作業の過程において、テーマファイルのアップロードをGitHubActionsを利用して自動化。push時に0.1.1などのようにタグを付けることで、アップロードされるように設定。'
		,imageUrl: 'eng-sch_mockup',
	},

];
